emacs/org-files.org
#+PROPERTY: header-args :results verbatim :tangle my-org-files.el :session org-files :cache no

* Org file utilities

  Provides utilities to create files to be used within Org mode.

  
** Warning: file is autogenerated via Org Babel tangle

   #+begin_src elisp
     ;;; WARNING: Do NOT edit this file by hand.
     ;; Instead edit the Org file and regenerate this
     ;; elisp script using: org-babel-tangle (C-c C-v t)

   #+end_src

   #+RESULTS:
   : nil
   

** Define special Org directories

   #+begin_src elisp
     (defvar my-org-agenda-dir 
       "~/org/31e520d4df"
       "Directory for Agenda files.")

     (defvar my-org-journal-dir
       "~/org/0f6de25076"
       "Directory for Journal files.")

     (defvar my-org-archive-dir
       "~/org/2204c36fc7"
       "Directory for Archive files.")
   #+end_src


** Listing special Org directories

   We want to list the directories that will be used as targets for
   new Org files:
   
   #+begin_src elisp
     (defun my-org-dirs ()
       "List special Org directories."
       (interactive)
       (cl-loop for symbol being the symbols
                when (and (boundp symbol)
                          (string-match-p "my-org-.*-dir" (symbol-name symbol)))
                collect symbol))
   #+end_src

   #+RESULTS:
   : my-org-dirs

   
*** Example output
    
    The function should return the list of all my special Org
    directories: 

    #+begin_src elisp :tangle no
      (my-org-dirs)
    #+end_src

    #+RESULTS:
    : (my-org-agenda-dir my-org-archive-dir my-org-journal-dir)


** 

** Announce as =my-org-files=

   #+begin_src elisp
     (provide 'my-org-files)
   #+end_src

   #+RESULTS:
   : my-org-files
